{
  "source_filename": "ICICI_Pru_Credit_AssurePersonal_Loan_C04_Ver1_25Jul2007_to_Till_Date.pdf",
  "content_summary": "Raw text extraction from ICICI_Pru_Credit_AssurePersonal_Loan_C04_Ver1_25Jul2007_to_Till_Date.pdf - 3 chunks with overlapping windows",
  "chunks": [
    "POLICY DOCUMENT Credut Assure 105N066V01 This is a summary of the Master Policy issued to the Member and contains important information about the Benefits. This document is part of, superseded by, and attendant to the Master Policy issued to the Proposer. 1. Definitions: - Unless excluded by or repugnant to the context, the following definitions will apply and, where consistent with the contents, the singular will include the plural and vice-versa, and the use of the masculine gender will include the feminine gender, and vice-versa. (a) \"Proposer\" or \"Master Policy Holder\" means the proposer for the Policy and whose customers are covered under the Scheme. The proposer shall be the institution/company financing the loan. (b) \"Company\" means ICICI Prudential Life Insurance Company Limited. (c) \"Master Policy\" means the credit assure insurance contract between the Proposer and the Company providing Life Cover to members who are the customers of the Proposer. (d) \"Life Cover\" (also referred as \"sum assured\") means the benefit payable due to death of the Member as per the Scheme. The Life Cover can be opted as \"Level Cover \"or as \"Reducing Cover\" depending on the nature of the loan. (e) \"Credit Assure Statement\" means the statement issued by the Company at the time of commencement of the Life Cover (Reducing Cover). The details include tenure of the life cover and benefit payable on the event of death. (f) \"Loan\" means the loan provided by the Proposer to its customer to finance the asset. The \"Loan\" shall also include loans provided as personal loans. The \"Loan\" shall be identified by an appropriate loan number that is referred in the proposal for Life Cover 2. Date of issuance of Life Cover The Life Cover as respects the Member shall be issued on the latest of the date (a) on which the Company receives the Premium as respects the Member (b) on which the Proposer makes disbursement of the loan as respects the Member (c) on which the underwriting decision is taken or the date on which the Company has received consent for the alternate terms, as the case may be and as respects the Member 3. Benefits subject to the Life Cover being In force (i) Benefit on death of the Member provided the death has occurred after the loan is disbursed In case of Level cover, the Company shall pay the Life Cover and in case of reducing cover the company shall pay the reduced life Cover, as specified in the Credit Assure statement, to the beneficiary as on the date of death of the Member. The Death benefit shall not apply in the event of death of a Member due to a cause other than accident within a period of 45 days from the date of issuance of the Life Cover and in whose respect; the Company had not required further evidence of health at the time of commencement of Life Cover. However, the Company shall return the Premium paid after deducting the expenses towards the issuance of the Life Cover. For the purpose of the above clause, the accident must be caused by violent, external and visible means. (ii) Benefit on Full prepayment -In case of the full prepayment of the loan or restructuring of the loan resulting in full prepayment the Life over shall cease and the Surrender Value shall be paid provided the same is at least Rs.250. The Surrender Value is computed as: 70% of the Premium Paid x outstanding term of Life Cover Total term of Life Cover (iii) Part prepayment of the Loan/ Change in the original loan repayment Schedule The Life Cover will continue provided that the prepayment of the Loan or any change in the original loan repayment schedule is not resulting into full prepayment of the Loan. (iv) Maturity Benefit -There is no benefit payable on the survival of the Member on the date of cessation of the term of the Life Cover. (v) The Life Cover shall not be terminated as respects the Member as long as the Member continues to be a customer of the Proposer. However, once the loan is fully repaid, the member will cease to be the customer of the proposer, the life cover will be terminated accordingly and the surrender value shall be paid provided it is at least Rs. 250. 4 Termination of the Life Cover - The Life Cover will terminate on the earliest of the date on which (a) the Loan is repaid in full, refinanced, discharged or assumed by another person/entity; (b) the Member ceases to be a customer of the Proposer for any reason whatsoever (c) the Member is no longer a guarantor or registered owner of the asset for which the Life Cover has been effected; (d) the Member attains age 70 years last birthday (e)",
    "cover will be terminated accordingly and the surrender value shall be paid provided it is at least Rs. 250. 4 Termination of the Life Cover - The Life Cover will terminate on the earliest of the date on which (a) the Loan is repaid in full, refinanced, discharged or assumed by another person/entity; (b) the Member ceases to be a customer of the Proposer for any reason whatsoever (c) the Member is no longer a guarantor or registered owner of the asset for which the Life Cover has been effected; (d) the Member attains age 70 years last birthday (e) on which the Member dies (f) on which the Life Cover benefit is paid in full in respect of the Loan. (g) the term of the Life Cover for which the Life Cover was effected, ceases. 5. Suicide -If the Member whether sane or insane commits suicide within one year of Date of issuance of Life Cover as respects the Member, while the Life cover is in force, the Cover shall be void as respects the Member and the premium paid as respects such Member shall be refunded after deducting proportional expenses incurred by the Company for the issue of the Life Cover. 6. The Contract -This Master Contract specifies and regulates the contractual relationship between the Proposer and the Company. The Member covered under this Master Policy is entitled only to the benefit specified in this Master Policy and has no other rights/title or interests hereunder. The Proposer shall hold this Master Policy and the Benefits arising out of this Policy shall be applied solely to reduce or completely discharge as the case may be the outstanding loan of the Member covered under this Master Policy. The balance money, if any, after the complete discharge of the outstanding loan, shall be payable to the beneficiary of the deceased Member. Upon the happening of the event on which a Benefit becomes payable, as authenticated by the Proposer by requisite documents, to the satisfaction of the Company, the Company shall pay the amount/s thereunder, to the Proposer or the beneficiary as the case may be. A receipt by the Proposer and/or beneficiary shall be a good, valid and sufficient discharge to the Company. 7. Termination of the Master Policy -In case of the termination of the Policy, the Company shall pay the surrender value to the Members covered under the Policy at that point of time. 8. Claims - Before payment of any claim under this Policy, the Company shall require the documents as respects the Member and after duly certified by the Proposer. The documents are Claim intimation cum Claimant's statement (format specified by the Company), Credit Assure Statement, Outstanding loan statement duly certified by the Proposer, Death certificate issued by local authority and the medical authority, Medical evidence, Police FIR & Post Mortem Examination reports in case of accidental death, Advance Discharge Voucher, Any other information/document as may be required by the Company for processing of the claim depending on the cause of claim. On receipt of required documents the Company will decide upon the Claim and process the claim payment. 9. Contract subject to Indian Laws - All assurances under the Scheme shall be subject to Indian Laws including any regulations made or advised or directive given by the Insurance Regulatory and Development Authority. 10. Legislative changes - The terms and conditions including the premium and the benefits payable are subject to variation in accordance with the relevant legislation. 11. Incontestability: In accordance to the Section 45 of the Insurance Act, 1938, no Policy of life insurance shall after the expiry of two years from the date on which it was effected, be called in question by an insurer on the ground that a statement made in the proposal of insurance or any report of a medical officer, or a referee, or friend of the insured, or in any other document leading to the issue of the Policy, was inaccurate or false, unless the insurer shows that such statements was on material matter or suppressed facts which it was material to disclose and that it was fraudulently made by the Policyholder and that the Policyholder knew at the time of making it that the statement was false or that it suppressed facts which it was material to disclose. Provided that nothing in the section shall prevent the insurer from calling for proof of age at any time if he is entitled to do so and no policy shall be deemed to be called in question merely because the terms of the Policy are adjusted on subsequent proof that the age of the Life Insured was incorrectly stated in the proposal. 12 Customer Service (a) For any clarification or assistance, the policy holder may contact our advisor or get",
    "time of making it that the statement was false or that it suppressed facts which it was material to disclose. Provided that nothing in the section shall prevent the insurer from calling for proof of age at any time if he is entitled to do so and no policy shall be deemed to be called in question merely because the terms of the Policy are adjusted on subsequent proof that the age of the Life Insured was incorrectly stated in the proposal. 12 Customer Service (a) For any clarification or assistance, the policy holder may contact our advisor or get in touch with any of the touch points as mentioned on the reverse of this booklet. Alternatively you may communicate with us: By mail at : Customer Service Desk ICICI Prudential Life Insurance Company Limited Vinod Silk Mill Compound, Chakravarthy Ashok Road, Kandivali (East), Mumbai - 400101 Facsimile : 022 67100805 E-mail : lifeline@iciciprulife.com The update in the contact details would be available on the Company Website"
  ]
}